# TextStyleSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextStyleSize Property
ParameterTypeId Class See Also
---
"Size"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextStyleSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextStyleSize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextStyleSize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace